[ORG 0x00]              ;코드 시작 어드레스 0x00으로 설정
[BITS 16]               ;이하의 코드는 16bit 코드로 설정

SECTION .test           ;섹션(세그먼트) 정의

jmp 0x07C0:START        ;CS 세그먼트 레지스터에 0X07C0을 복사하면서 STRAT레이블로 이동



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;   DIA64 OS에 관련된 환경 설정값
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
TOTALSECTORCOUNT: dw 1024


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;   코드영역
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
START:
    mov ax, 0x07C0      ;부트로더 시작 어드레스(0X07C0)를 세그먼트 레지스터 값으로 변환
    mov ds, ax
    mov ax, 0XB800      ;비디오 메모리의 시작 어드레스(0XB800)를 세그먼트 레지스터 값으로 변환
    mov es, ax          ;ES(Extra Segment): 문자열 연산이나 메모리 복사 작업 시 데이터를 임시로 저장하는 레지스터

    ;스택을 0x0000:0000~0x0000:FFFF 영역에 64KB 크기로 생성
    mov ax, 0x0000 ;스택 세그먼트의 시작 어드레스를 세그먼트 레지스터 값으로 변환
    mov ss, ax      ;ss(stack Segment) 레지스터에 설정
    mov sp, 0xFFFE  ;SP(Stack Pointer) 레지스터 설정
    mov bp, 0xFFFE  ;BP(Base Pointer) 레지스터 설정
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;   화면을 모두 지우고, 속성값을 녹색으로 설정
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    mov si, 0           ;SI Register: 문자열 원본 인덱스 레지스터

.SCREENCLEARLOOP:                   ;0xB800(모니터 출력) 메모리 출력부분 초기화
    mov byte [ es: si ], 0          ;비디오 메모리의 문자가 위치하는 어드레스, 0을 복사하여 문자 삭제
    mov byte [ es: si+1 ], 0x0A     ;비디오 메모리의 스타일 지정(검은바탕, 초록글자)

    add si, 2                       ;비디오 메모리는 (상위1바이트:하위1바이트) = (글자:스타일) 2바이트가 한세트임

    cmp si, 80 * 25 * 2             ;비디오 메모리의 총크기 80 * 25 사이즈
    jl .SCREENCLEARLOOP             ;si의 크기가 비디오 메모리 총크기보다 작다면 루프

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;   화면 상단에 시작 메세지 출력
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    push MESSAGE1                   ; parameter 3
    push 0                          ; parameter 2
    push 0                          ; parameter 1
    call PRINTMESSAGE               ; PRINTMESSAGE(0, 0 , MESSAGE1)
    add sp, 6                       ; 스택에서 parameter 제거

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;   OS 이미지를 로딩한다는 메세지 출력
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    push IMAGELOADINGMESSAGE
    push 1
    push 0
    call PRINTMESSAGE
    add sp, 6

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;   디스크에서 OS 이미지를 로딩
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;   디스크를 읽기전에 미리 리셋
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
RESETDISK:
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;   BIOS Reset Function Call
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;service number: 0, driver number(0 = Floppy)
    mov ax, 0
    mov dl, 0
    int 0x13
    jc HANDLEDISKERROR  ;에러가 발생하면 에러 처리로 이동

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;   디스크에서 섹터를 읽음
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;디스크의 내용을 메모리로 복사할 어드레스(ES:BX)를 0x10000으로 설정
    mov si,0x1000       ;OS 이미지를 복사할 어드레스(0X10000)를 세그먼트 레지스터 값으로 변환
    mov es, si          ;ES세그먼트 레지스터에 값 설정
    mov bx, 0x0000      ;BX 레지스터에 0x0000을 설정하여 복사할 어드레스를 0x1000:0000(0x1000)으로 최종 설정

    mov di, word [ TOTALSECTORCOUNT ]   ;복사할 OS 이미지의 섹터 수를 DI 레지스터에 설정

READDATA:       ;디스크를 읽는 코드의 시작
    ; 모든 섹터를 다 읽었는지 확인
    cmp di, 0       ;복사할 OS 이미지의 섹터 수를 0과 비교
    je READEND      ;복사할 섹터 수가 0이라면 다 복사함, READEND로 점프
    sub di, 0x1     ;복사할 섹터수를 1 감소

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;   BIOS Read Function 호출
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    mov ah, 0x02                        ;ah: "BIOS 기능 번호" 주머니 02: read
    mov al, 0x01                        ;al: "연산 결과 및 개수" 주머니, 한번에 몇개의 섹터를 읽을지
    mov ch, byte [ TRACKNUMBER ]        ;ch: "디스크 트랙(Cylinder) 번호" 주머니
    mov cl, byte [ SECTORNUMBER ]       ;cl: "디스크 섹터(Sector) 번호 & 반복 횟수" 주머니
    mov dh, byte [ HEADNUMBER ]         ;dh: "디스크 헤드(Head) 번호" 주머니
    mov dl, 0x00                        ;dl: "부팅/디스크 장치 번호" 주머니, 윈도우의 경우 부팅 디스크가 C드라이브여서 0x08로 부팅
    int 0x13                            ;인터럽트 서비스 수행, 13번 인터럽트 (0x13): 디스크 하드웨어를 제어할 때 사용
                                        ;int 13 인터럽트 수행 동작
                                            ;1. CH, CL, DH, DL을 보고 디스크 주소로 찾아가서 데이터를 퍼 올린다.
                                            ;2. 퍼 올린 데이터를 ES:BX가 가리키고 있는 메모리 주소로 가서 꽉꽉 채워 넣는다(Write).
    jc HANDLEDISKERROR                  ;오류 발생시 HANDLEDISKERROR로 이동

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;   복사할 어드레스와 트렉, 헤드, 섹터 어드레스 계산
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    add si, 0x0020      ;512(0x200)바이트 만큼 읽었으므로, 이를 세그먼트 레지스터 값으로 변환
    mov es, si          ; ES세그먼트 레지스터에 더해서 어드레스를 한 섹터만큼 증가

    ;한 섹터를 읽었으므로 섹터 번호를 증가시키고 마지막 섹터(18)까지 읽었는지 판단
    ;마지막 섹터가 아니면 섹터 읽기로 이동해서 다시 섹터 읽기 수행
    mov al, byte[ SECTORNUMBER ]    ;현재 섹터 번호를 al에 설정
    add al, 0x01                    ;섹터 번호를 1 증가
    mov byte [ SECTORNUMBER ], al   ;증가시킨 섹터 번호를 SECTORNUMBER에 다시 설정
    cmp al, 19                      ;증가시킨 섹터 번호를 19와 비교
    jl READDATA                     ;섹터 번호가 19 미만이라면 READDATA로 이동

    ;마지막 섹터까지 읽었으면(섹터 번호가 19이면) 헤드를 토글(0->1, 1->0)하고 섹터번호를 1로 설정
    xor byte [ HEADNUMBER ], 0x01   ;헤드 번호를 1과 xor연산하여 토글
    mov byte [ SECTORNUMBER ], 0x01 ;섹터 번호를 1로 설정

    ;만약 헤드가 (1->0)으로 바뀌었다면 헤드를 모두 읽은 것임으로 아래로 이동
    cmp byte[ HEADNUMBER ], 0x00    ;헤드 번호를 0x00와 비교
    jne READDATA                    ;헤드 번호가 0이 아니라면 READDATA로 점프

    ;트랙을 1 증가시킨 후, 다시 섹터 읽기로 이동
    add byte[ TRACKNUMBER ], 0x01   ;트랙 번호를 1 증가
    jmp READDATA                    ;READDATA로 이동
READEND:

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;   OS 이미지가 완료되었다는 메세지를 출력
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    push LOADINGCOMPLETEMESSAGE
    push 1
    push 20
    call PRINTMESSAGE
    add sp, 6

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;   로딩한 가상 OS 이미지 실행   
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    jmp 0x1000:0x0000

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;   함수 코드 영역
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;디스크 에러를 처리하는 함수
HANDLEDISKERROR:
    push DISKERRORMESSAGE
    push 1
    push 20
    call PRINTMESSAGE
    jmp $

;메세지를 출력하는 함수
;   PARAM: x좌표, y좌표, 문자열
PRINTMESSAGE:
    push bp     ;베이스 포인터 레지스터 스택에 push
    mov bp, SP  ; bp를 통해 파라미터에 접근할 목적
    
    push es
    push si
    push di
    push ax
    push cx
    push dx

    ;ES 세그먼트 레지스터에 비디오 모드 어드레스 설정
    mov ax, 0xB800  ;비디오 메모리 시작 어드레스 (0xB800)
    mov es, ax      ;ES세그먼트 레지스터에 설정

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;   X, Y 좌표로 비디오 메모리의 어드레스를 계산 - PRINTMESSAGE(X, Y, String);
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; Y좌표를 이용해서 먼저 라인 어드레스를 구함
    mov ax, word [ bp + 6 ]     ; 2번째 파라미터(화면 좌표 Y)를 AX 레지스터에 설정
    mov si, 160                 ; 한 라인의 바이트 수 (2*80컬럼) 을 SI레지스터에 설정
    mul si                      ; AX레지스터와 SI레지스터를 곱하여 화면 Y어드레스를 계산
    mov di, ax                  ; 계산된 화면 Y어드레스를 DI레지스터에 설정

    ; X좌표를 이용해서 2를 곱한 후 최종 어드레스를 구함
    mov ax, word[ bp + 4 ]      ; 1번째 파라미터(화면 좌표 X)를 AX 레지스터에 설정
    mov si, 2                   ; 한 문자를 나타내는 바이트 수(2)를 SI레지스터에 설정
    mul si                      
    add di, ax                  ; 실제 video memory address 계산

    ;출력할 문자열의 어드레스
    mov si, word[ bp + 8 ]      ; 3번째 파라미터(출력할 문자열)

.MESSAGELOOP:
    mov cl, byte[ si ]
    cmp cl, 0 
    je .MESSAGEEND

    mov byte [es : di], cl      ; video memory address space에 문자열 하나를 저장
    add si, 1                   ; 문자열을 가리키는 레지스터 1증가
    add di, 2                   ; video memory address space에 문자열은 2byte씩 저장됨으로 2칸 증가

    jmp .MESSAGELOOP

.MESSAGEEND
    pop dx
    pop cx
    pop ax
    pop di
    pop si
    pop es
    pop bp
    ret

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;   데이터 영역
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;부트로더 시작메세지
MESSAGE1: db 'DIA64 OS Boot Loader Start~!!', 0    ;출력하고자하는 문자열

DISKERRORMESSAGE:       db 'DISK Error~!!', 0
IMAGELOADINGMESSAGE:    db 'OS Image Loading...', 0
LOADINGCOMPLETEMESSAGE: db 'Complete~!!', 0

;디스크 읽기에 관련된 변수들
SECTORNUMBER:   db 0x02 ;OS 이미지가 시작하는 섹터 번호를 저장하는 영역
HEADNUMBER:     db 0X00 ;OS 이미지가 시작하는 헤드 번호를 저장하는 영역
TRACKNUMBER:    db 0x00 ;OS 이미지가 시작하는 트렉 번호를 저장하는 영역


times 510 - ($ - $$) db 0x00                    ;현재 위치(cs) 기준 남은 공간을 510번지까지 0으로 초기화 
db 0x55
db 0xAA                                         ;부트로더 라는걸 알려주는 코드









